templates/Multi-Client Setup/config.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/Library/WebServer/Documents/tsungui-mdm/tsung-1.0.dtd">
<tsung loglevel="info" dumptraffic="true" version="1.0">

	<clients>
		<client host="localhost" use_controller_vm="true"/>
	</clients>

	<servers>
		<server host="apirt.synapsys.us" port="80" type="tcp"/>
	</servers>

	<load>
		<arrivalphase phase="1" duration="1" unit="minute">
			<users maxnumber="100" interarrival="4" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="2" duration="2" unit="minute">
			<users maxnumber="100" interarrival="1" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="3" duration="2" unit="minute">
			<users maxnumber="100" arrivalrate="10" unit="second"></users>
		</arrivalphase>
	</load>

	<options>
		<option type="ts_http" name="user_agent">
			<user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
			<user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
		</option>
	</options>

	<sessions>
		<session name="http-example" probability="100" type="ts_http">
			<request>
				<http url="/index.php" contents="widget=national-weathers&amp;wid=8&amp;skip=0&amp;limit=1" method="GET" version="1.1"/>
			</request>
		</session>
	</sessions>

</tsung>